//Курс: Исключения в программировании и их обработка
//Урок 1: Обработка ошибок в программировании
//Домашнее задание

// Задание 3
// Реализуйте метод divArrays, принимающий в качестве аргументов два целочисленных массива a и b,
// и возвращающий новый массив с, каждый элемент которого равен частному элементов двух входящих массивов в той же ячейке.
//Если длины массивов не равны - верните нулевой массив длины 1.
//Важно: При выполнении метода единственное исключение, которое пользователь может увидеть - RuntimeException, т.е. ваше.
//Напишите свой код в методе divArrays класса Answer. Метод divArrays принимает на вход два параметра:
//int[] a - первый массив
//int[] b - второй массив


public class Main
{
    public static void main(String[] args)
    {
        Printer.main(args);
    }
}