//Курс: Исключения в программировании и их обработка
//Урок 1: Обработка ошибок в программировании
//Домашнее задание

// Задание 1
// Реализуйте 3 метода, чтобы в каждом из них получить разные исключения.
//Метод arrayOutOfBoundsException - Ошибка, связанная с выходом за пределы массива
//Метод divisionByZero - Деление на 0
//Метод numberFormatException - Ошибка преобразования строки в число
//Важно: они не должны принимать никаких аргументов

public class Main
{
    public static void main(String[] args)
    {
        Printer.main();
    }
}