//Курс: Исключения в программировании и их обработка
//Урок 1: Обработка ошибок в программировании
//Домашнее задание

// Задание 2
//Реализуйте метод subArrays, принимающий в качестве аргументов два целочисленных массива a и b,
// и возвращающий новый массив c, каждый элемент которого равен разности элементов двух входящих массивов в той же ячейке.
//Если длины массивов не равны - верните нулевой массив длины 1.
//Напишите свой код в методе subArrays класса Answer.
// Метод subArrays принимает на вход два параметра:
//int[] a - первый массив
//int[] b - второй массив

public class Main
{
    public static void main(String[] args)
    {
        Printer.main(args);
    }
}